/*-----------------------------------------------------------------------------
Copyright 2017 - 2020, BingoBox Inc.
License     : Internal Use.
Author      : 
Description : 
-----------------------------------------------------------------------------*/

#ifndef BINGOBIN_CONFIG_H_
#define BINGOBIN_CONFIG_H_

/* include ANSI C .h file */
/* include Other Lib .h file */
/* include Project .h file */
/* include Local .h file */

/*---------------------------------------------------------------------------*/
//	Global Defines and Macros
/*---------------------------------------------------------------------------*/
#define BG_UART_DEBUG           //UART调试
//#define BG_LED                  //LED驱动 灯箱
//#define BG_SMOKE_ALARM          //烟雾报警
//#define BG_485_METER            //电能表
//#define BG_DOOR_LOCK			//门锁
#define BG_INFRARED             //红外收发功能

#define BG_W5500		        //W5500
//#define BG_WDT                        //看门狗
#define BG_INFO                       //参数存储
#define USE_UNIQUE_CHIP_IP_SET_MAC    //使用芯片ID来设置mac地址

#ifdef BG_DOOR_LOCK

#define DOOR_STATE_ADC          //门锁用ADC检测状态

#endif

/*---------------------------------------------------------------------------*/
//	Global Types and Enums
/*---------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*/
//	Global Constants
/*---------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*/
//	Global Variables
/*---------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*/
//	Global Function prototypes
/*---------------------------------------------------------------------------*/
/*-----------------------------------------------------------------------------
Prototype  : 
Parameters : 
Return     : 
Function   : 
-----------------------------------------------------------------------------*/

#endif /* End of BINGOBIN_CONFIG_H_ */
